In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'Product_ID': [1, 2, 3, 4, 5, np.nan],
    'Product_Name': ['Laptop', 'Phone', 'TV', 'Headphones', None, 'Microwave'],
    'Stock': [20, 15, np.nan, 30, 25, 12],
    'Price': [999.99, 799.99, 399.99, np.nan, 59.99, 99.99],
    'Discounted': [True, False, True, False, np.nan, True],
}

target_df = pd.DataFrame(data)

In [3]:
target_df

   Product_ID Product_Name  Stock   Price Discounted
0         1.0       Laptop   20.0  999.99       True
1         2.0        Phone   15.0  799.99      False
2         3.0           TV    NaN  399.99       True
3         4.0   Headphones   30.0     NaN      False
4         5.0         None   25.0   59.99        NaN
5         NaN    Microwave   12.0   99.99       True

### Identify Null Values

#### How would you identify rows where the 'Stock' column has null values in the provided target_df DataFrame?

In [10]:
target_df['Stock'].isna().any()

True

#### Can you list the columns in target_df that contain at least one null value?

In [15]:
target_df.notna().any()

Product_ID      True
Product_Name    True
Stock           True
Price           True
Discounted      True
dtype: bool

#### How would you use pd.isna() to identify null values in the entire target_df DataFrame?

In [19]:
pd.isna(target_df)

   Product_ID  Product_Name  Stock  Price  Discounted
0       False         False  False  False       False
1       False         False  False  False       False
2       False         False   True  False       False
3       False         False  False   True       False
4       False          True  False  False        True
5        True         False  False  False       False

#### If you wanted to identify rows where both 'Stock' and 'Price' have null values, how would you do it?

In [24]:
target_df.loc[(target_df.loc[:, "Stock"].isna() == True) & (target_df.loc[:, "Price"].isna() == True)]

Empty DataFrame
Columns: [Product_ID, Product_Name, Stock, Price, Discounted]
Index: []

In [26]:
target_df.iloc[2, 3] = np.nan

In [27]:
target_df.loc[(target_df.loc[:, "Stock"].isna() == True) & (target_df.loc[:, "Price"].isna() == True)]

   Product_ID Product_Name  Stock  Price Discounted
2         3.0           TV    NaN    NaN       True

In [28]:
(target_df.loc[:, "Stock"].isna() == True) & (target_df.loc[:, "Price"].isna() == True)

0    False
1    False
2     True
3    False
4    False
5    False
dtype: bool

In [29]:
target_df.loc[:, "Stock"].isna() == True

0    False
1    False
2     True
3    False
4    False
5    False
Name: Stock, dtype: bool

In [30]:
target_df.loc[:, "Price"].isna() == True

0    False
1    False
2     True
3     True
4    False
5    False
Name: Price, dtype: bool

### Filtering

#### How would you filter out rows where the 'Stock' column has null values in the target_df DataFrame?

In [36]:
target_df['Stock'].isna()

0    False
1    False
2     True
3    False
4    False
5    False
Name: Stock, dtype: bool

In [38]:
target_df.loc[target_df['Stock'].isna()]

   Product_ID Product_Name  Stock  Price Discounted
2         3.0           TV    NaN    NaN       True

#### What method would you use to remove any row that has at least one null value in target_df?

In [39]:
df_temp = target_df.copy()

In [40]:
df_temp

   Product_ID Product_Name  Stock   Price Discounted
0         1.0       Laptop   20.0  999.99       True
1         2.0        Phone   15.0  799.99      False
2         3.0           TV    NaN     NaN       True
3         4.0   Headphones   30.0     NaN      False
4         5.0         None   25.0   59.99        NaN
5         NaN    Microwave   12.0   99.99       True

In [41]:
df_temp.dropna(inplace=True)

In [42]:
df_temp

   Product_ID Product_Name  Stock   Price Discounted
0         1.0       Laptop   20.0  999.99       True
1         2.0        Phone   15.0  799.99      False

#### If you only want to drop rows where both 'Stock' and 'Price' have null values, how would you go about doing this in target_df?

In [51]:
target_df.loc[target_df['Stock'].isna() & target_df['Price'].isna()]

   Product_ID Product_Name  Stock  Price Discounted
2         3.0           TV    NaN    NaN       True

In [52]:
tobe_dropped = target_df.loc[target_df['Stock'].isna() & target_df['Price'].isna()].index.values

In [54]:
tobe_dropped

array([2])

In [55]:
target_df.drop(labels=tobe_dropped)

   Product_ID Product_Name  Stock   Price Discounted
0         1.0       Laptop   20.0  999.99       True
1         2.0        Phone   15.0  799.99      False
3         4.0   Headphones   30.0     NaN      False
4         5.0         None   25.0   59.99        NaN
5         NaN    Microwave   12.0   99.99       True

### Filling

#### How would you fill null values in the 'Stock' column with the median value of that column?

In [63]:
df_temp = target_df.copy()

In [64]:
df_temp

   Product_ID Product_Name  Stock   Price Discounted
0         1.0       Laptop   20.0  999.99       True
1         2.0        Phone   15.0  799.99      False
2         3.0           TV    NaN     NaN       True
3         4.0   Headphones   30.0     NaN      False
4         5.0         None   25.0   59.99        NaN
5         NaN    Microwave   12.0   99.99       True

In [65]:
df_temp['Stock'].fillna(value=target_df['Stock'].median(), inplace=True)

In [66]:
df_temp

   Product_ID Product_Name  Stock   Price Discounted
0         1.0       Laptop   20.0  999.99       True
1         2.0        Phone   15.0  799.99      False
2         3.0           TV   20.0     NaN       True
3         4.0   Headphones   30.0     NaN      False
4         5.0         None   25.0   59.99        NaN
5         NaN    Microwave   12.0   99.99       True

#### Can you use the .fillna() method to fill null values in multiple columns ('Stock' and 'Price') at once? If so, how?

In [67]:
df_temp = target_df.copy()

In [68]:
df_temp

   Product_ID Product_Name  Stock   Price Discounted
0         1.0       Laptop   20.0  999.99       True
1         2.0        Phone   15.0  799.99      False
2         3.0           TV    NaN     NaN       True
3         4.0   Headphones   30.0     NaN      False
4         5.0         None   25.0   59.99        NaN
5         NaN    Microwave   12.0   99.99       True

In [76]:
stock_med = df_temp['Stock'].median()
price_med = df_temp['Price'].median()

In [77]:
med_values = {'Stock':stock_med, 'Price':price_med}

In [78]:
df_temp.loc[df_temp['Stock'].isna() | df_temp['Price'].isna()].fillna(value=med_values)

   Product_ID Product_Name  Stock   Price Discounted
2         3.0           TV   20.0  449.99       True
3         4.0   Headphones   30.0  449.99      False

#### If you only want to fill the first null value in each column with a zero, how would you do it?

In [105]:
temp_df = target_df.copy()

In [106]:
temp_df.isna()

   Product_ID  Product_Name  Stock  Price  Discounted
0       False         False  False  False       False
1       False         False  False  False       False
2       False         False   True   True       False
3       False         False  False   True       False
4       False          True  False  False        True
5        True         False  False  False       False

In [107]:
temp_df.isna().idxmax()

Product_ID      5
Product_Name    4
Stock           2
Price           2
Discounted      4
dtype: int64

In [110]:
col_ind_to_be_updated = list(temp_df.isna().idxmax().items())

In [111]:
col_ind_to_be_updated

[('Product_ID', 5),
 ('Product_Name', 4),
 ('Stock', 2),
 ('Price', 2),
 ('Discounted', 4)]

In [112]:
for col,ind in col_ind_to_be_updated:
    temp_df.loc[ind, col] = 0

In [113]:
temp_df

   Product_ID Product_Name  Stock   Price Discounted
0         1.0       Laptop   20.0  999.99       True
1         2.0        Phone   15.0  799.99      False
2         3.0           TV    0.0    0.00       True
3         4.0   Headphones   30.0     NaN      False
4         5.0            0   25.0   59.99          0
5         0.0    Microwave   12.0   99.99       True

In [114]:
# with fillna method

In [115]:
target_df.fillna(value=0, limit=1)

   Product_ID Product_Name  Stock   Price Discounted
0         1.0       Laptop   20.0  999.99       True
1         2.0        Phone   15.0  799.99      False
2         3.0           TV    0.0    0.00       True
3         4.0   Headphones   30.0     NaN      False
4         5.0            0   25.0   59.99          0
5         0.0    Microwave   12.0   99.99       True

### Counting

#### How would you count the number of null values in the entire DataFrame?

In [116]:
target_df

   Product_ID Product_Name  Stock   Price Discounted
0         1.0       Laptop   20.0  999.99       True
1         2.0        Phone   15.0  799.99      False
2         3.0           TV    NaN     NaN       True
3         4.0   Headphones   30.0     NaN      False
4         5.0         None   25.0   59.99        NaN
5         NaN    Microwave   12.0   99.99       True

In [121]:
target_df.isna().values.sum()

6

#### Is there a way to get a count of non-null values for each column in the DataFrame?

In [124]:
target_df.notna().sum()

Product_ID      5
Product_Name    5
Stock           5
Price           4
Discounted      5
dtype: int64

#### How would you count null values in a specific row, say the row at index 2?

In [128]:
target_df.iloc[2].isna().sum()

2

### Replacing

#### If you wanted to replace all null values in the DataFrame with the string "Unknown", how would you do it?

In [130]:
target_df.fillna('Unknown')

  Product_ID Product_Name    Stock    Price Discounted
0        1.0       Laptop     20.0   999.99       True
1        2.0        Phone     15.0   799.99      False
2        3.0           TV  Unknown  Unknown       True
3        4.0   Headphones     30.0  Unknown      False
4        5.0      Unknown     25.0    59.99    Unknown
5    Unknown    Microwave     12.0    99.99       True

#### Can you replace null values in one column ('Stock') with zero and in another column ('Discounted') with False, all in a single line of code?

In [131]:
target_df.fillna(value={'Stock':0, 'Discounted':False})

   Product_ID Product_Name  Stock   Price  Discounted
0         1.0       Laptop   20.0  999.99        True
1         2.0        Phone   15.0  799.99       False
2         3.0           TV    0.0     NaN        True
3         4.0   Headphones   30.0     NaN       False
4         5.0         None   25.0   59.99       False
5         NaN    Microwave   12.0   99.99        True

#### How would you replace all instances of a specific value, let's say 999.99 in the 'Price' column, with np.nan?

In [132]:
target_df.loc[:, 'Price'].replace(999.99, np.nan)

0       NaN
1    799.99
2       NaN
3       NaN
4     59.99
5     99.99
Name: Price, dtype: float64

### Operations

#### How would you calculate the sum of each column in target_df, considering that some columns might have null values?

In [144]:
target_df.select_dtypes(include=np.number).sum()

Product_ID      15.00
Stock          102.00
Price         1959.96
dtype: float64

#### If you have null values in the 'Stock' and 'Price' columns, and you attempt to multiply these columns element-wise, what will happen to the resulting product where null values are involved?

In [147]:
target_df[['Stock', 'Price']]

   Stock   Price
0   20.0  999.99
1   15.0  799.99
2    NaN     NaN
3   30.0     NaN
4   25.0   59.99
5   12.0   99.99

In [148]:
target_df['Stock'] * target_df['Price']

0    19999.80
1    11999.85
2         NaN
3         NaN
4     1499.75
5     1199.88
dtype: float64

#### How would you use the dropna method to perform an operation, say calculating the mean, only on non-null elements in the 'Stock' column?

In [154]:
target_df.dropna()['Stock'].mean()

17.5

### Propagating

#### How would you propagate the last valid observation in the 'Stock' column to fill NaN values?

In [160]:
target_df['Stock']

0    20.0
1    15.0
2     NaN
3    30.0
4    25.0
5    12.0
Name: Stock, dtype: float64

In [161]:
target_df['Stock'].ffill()

0    20.0
1    15.0
2    15.0
3    30.0
4    25.0
5    12.0
Name: Stock, dtype: float64

#### Can you propagate the next valid observation backward to fill NaN values in the 'Price' column? If so, how would you do it?

In [159]:
target_df['Stock'].bfill()

0    20.0
1    15.0
2    30.0
3    30.0
4    25.0
5    12.0
Name: Stock, dtype: float64

#### How would you limit the number of NaN values filled by forward fill (or backward fill) to 1 in the 'Stock' column?

In [162]:
target_df.ffill(limit=1)

   Product_ID Product_Name  Stock   Price  Discounted
0         1.0       Laptop   20.0  999.99        True
1         2.0        Phone   15.0  799.99       False
2         3.0           TV   15.0  799.99        True
3         4.0   Headphones   30.0     NaN       False
4         5.0   Headphones   25.0   59.99       False
5         5.0    Microwave   12.0   99.99        True